[
  {
    "id": 1,
    "title": "1984",
    "author_id": 1,
    "description": "Published on June 8, 1949, George Orwell's '1984' is a seminal dystopian social science fiction novel and cautionary tale about the dangers of totalitarianism. The novel delves into the oppressive regime of Big Brother and the Party, which seeks to control every aspect of individual life and thought. Orwell's vivid depiction of a society under constant surveillance and mind control is a stark warning against the loss of personal freedoms and the unchecked power of authoritarian governments. The protagonist, Winston Smith, navigates a world where independent thinking is a crime, and his struggle for truth and individuality stands as a powerful critique of oppressive political systems.\n\nOrwell's '1984' remains profoundly relevant, offering insights into the mechanics of control and manipulation in modern societies. The novel's themes of surveillance, propaganda, and the erasure of history resonate strongly in today's world, making it a critical piece of literature for understanding the dynamics of power and resistance.",
    "published_date": "1949-06-08",
    "isbn": "9780451524935",
    "image_url": "https://covers.openlibrary.org/b/id/8221241-L.jpg"
  },
  {
    "id": 2,
    "title": "Harry Potter and the Sorcerer's Stone",
    "author_id": 2,
    "description": "Published on June 26, 1997, J.K. Rowling's 'Harry Potter and the Sorcerer's Stone' is the first book in the Harry Potter series, introducing readers to the young wizard Harry Potter. This enchanting novel takes readers on a journey through the magical world of Hogwarts School of Witchcraft and Wizardry, where Harry discovers his true heritage and the extraordinary world of magic that awaits him. Alongside his new friends Hermione Granger and Ron Weasley, Harry faces numerous challenges, including the sinister presence of the dark wizard Voldemort.\n\nThe novel's rich narrative and imaginative world-building have captivated readers of all ages, making it a beloved classic in contemporary literature. The themes of friendship, bravery, and the battle between good and evil are masterfully woven into a story that continues to inspire and entertain. 'Harry Potter and the Sorcerer's Stone' is an essential read for anyone who loves magical adventures and timeless tales of heroism.",
    "published_date": "1997-06-26",
    "isbn": "9780439708180",
    "image_url": "https://covers.openlibrary.org/b/id/7984916-L.jpg"
  },
  {
    "id": 3,
    "title": "The Hobbit",
    "author_id": 3,
    "description": "Published on September 21, 1937, J.R.R. Tolkien's 'The Hobbit' is a fantasy novel and children's book that serves as a precursor to 'The Lord of the Rings.' The story follows the adventures of Bilbo Baggins, a hobbit who is thrust into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Guided by the wizard Gandalf and accompanied by a company of dwarves, Bilbo embarks on a journey that takes him through perilous landscapes and introduces him to a host of memorable characters, including Gollum and the mysterious One Ring.\n\n' The Hobbit' is celebrated for its rich narrative and imaginative world-building, providing a foundation for Tolkien's expansive Middle-earth legendarium. The novel's themes of courage, adventure, and the discovery of one's potential resonate deeply with readers, making it a timeless classic in the fantasy genre. 'The Hobbit' remains a beloved tale for both children and adults, offering a captivating escape into a world of magic and heroism.",
    "published_date": "1937-09-21",
    "isbn": "9780547928227",
    "image_url": "https://covers.openlibrary.org/b/id/7888782-L.jpg"
  },
  {
    "id": 4,
    "title": "To Kill a Mockingbird",
    "author_id": 4,
    "description": "Published on July 11, 1960, Harper Lee's 'To Kill a Mockingbird' is a profoundly impactful novel that addresses themes of racial injustice and moral growth in the American South. Set in the 1930s in the fictional town of Maycomb, Alabama, the story is narrated by Scout Finch, a young girl whose father, Atticus Finch, is an attorney defending a black man falsely accused of raping a white woman. Through Scout's eyes, readers witness the deep-seated prejudices and social injustices of the time, as well as the courage and integrity of those who stand against them.\n\n' To Kill a Mockingbird' is widely studied in schools for its powerful exploration of human behavior and the complexities of moral conscience. The novel's memorable characters, poignant themes, and timeless messages about empathy and justice continue to resonate with readers, making it an enduring classic in American literature.",
    "published_date": "1960-07-11",
    "isbn": "9780061120084",
    "image_url": "https://covers.openlibrary.org/b/id/12606567-L.jpg"
  },
  {
    "id": 5,
    "title": "The Great Gatsby",
    "author_id": 5,
    "description": "Published on April 10, 1925, F. Scott Fitzgerald's 'The Great Gatsby' is a novel that critiques the American Dream during the Jazz Age. Set in the 1920s, the story follows the enigmatic and wealthy Jay Gatsby and his unrelenting love for Daisy Buchanan. Narrated by Nick Carraway, a bond salesman who rents a house next to Gatsby's opulent mansion on Long Island, the novel explores themes of decadence, idealism, resistance to change, and the hollowness of the American Dream. Gatsby's lavish parties and mysterious past are central to the novel's exploration of social stratification and the pursuit of happiness.\n\n' The Great Gatsby' is celebrated for its lyrical prose and keen social commentary, offering a vivid portrait of the excesses and moral decay of the era. Fitzgerald's portrayal of the elusive American Dream continues to captivate readers and provoke critical reflection on the nature of success and fulfillment. The novel remains a cornerstone of American literature, renowned for its enduring themes and literary craftsmanship.",
    "published_date": "1925-04-10",
    "isbn": "9780743273565",
    "image_url": "https://covers.openlibrary.org/b/id/8221256-L.jpg"
  }
]
